{
	"SONGS_FOLDER" : "the SONGS FOLDER is where benny looks for all the songs of the current set. you can change this from the ... menu in the files page of benny, or here.",
	"RECORD_FOLDER" : "the RECORD FOLDER is where recorded audio files are saved. you can change this from the ... menu in the files page of benny, or here.",
	"type_order" : "this is the order the new block menu uses to list the available blocks.",
	"gain_display_format" : "can also be toggled in benny by clicking the number on a gain slider, between floating point numbers and dB.",
	"click_buffer_scaledown" : "the smallest possible clickable area. leave it on 2 unless you're on very high dpi screen.",
	"UPSAMPLING" : "global enable for audio block upsampling (turn off on low end systems)",
	"RECYCLING" : "attempt to recycle voice patchers to speed up loading (leave on)",
	"waves_preloading" : "preload all the waves referenced by songs in the current song folder when benny starts",
	"wire_dia" : "diameter of the wires in the blocks view",
	"glow" : "post processing ui glow effect amount",
	"monofont" : "monospaced font",
	"mainfont" : "main font",
	"SELF_CONNECT_REQUIRES_SHIFT" : "if enabled you need to hold shift to connect a block to itself.",
	"ALWAYS_AUTOCONNECT_IF_YOU_CAN" : "if on, then if you make a new block (via type-to-search) and you had a block selected already then the new block will be automatically connected to it",
	"STATE_FADE_DRAG_THRESHOLD" : "distance you have to drag from a state button before it turns into a fader",
	"MAX_BEZIER_SEGMENTS" : "maximum number of segments to make a wire out of (raising this seems to make the gpu work hard)",
	"FSAA" : "anti-aliasing in the benny window. saves a little bit of gpu load on systems with built in gpus and hi res screens",
	"MAX_BLOCKS" : "number of blocks available.",
	"MAX_NOTE_VOICES" : "number of note voices available",
	"MAX_AUDIO_VOICES" : "number of audio voice available. has a big effect on baseline cpu usage (the matrix mixer that connects all the audio voices internally is the cause of this). 64 is fine on mid range systems, to keep a laptop from getting too hot for simple patches on the sofa you can set this to 16",
	"MAX_AUDIO_INPUTS" : 18,
	"MAX_AUDIO_OUTPUTS" : 24,
	"smart_soft_pickup" : "for midi controllers with normal potentiometers (as opposed to encoders or motorised potentiometers) benny has a smart method for when a knob or fader's position doesn't match the value it's mapped to - it remaps the fader curve around the difference. this is better than standard soft pickup as there are no dead zones - moving the fader always makes a change of value in the same direction.",
	"AUDIO_TO_DATA_DOWNSAMPLE" : "this mostly affects the minimum scope zoom and how smooth the scopes look. the default 1 is the best appearance, reducing the amount of samples taken (eg 4 or 8) gives a ~20% cpu use reduction on large patches on low end systems.",
	"NO_IO_PER_BLOCK" : "in theory this allows blocks with more io to be loaded, but a lot of supporting infrastructure for that is not ready. do not adjust.",
	"MAX_PARAMETERS" : "max parameters a voice can have. do not adjust.",
	"MAX_DATA" : 16384,
	"MAX_MOD_IDS" : 1024,
	"MAX_WAVES_SLICES" : 1024,
	"MAX_WAVES" : 16,
	"MAX_HARDWARE_MIDI_OUTS" : 256,
	"MAX_HARDWARE_BLOCKS" : 64,
	"MAX_CONNECTIONS_PER_OUTPUT" : 32,
	"MAX_OUTPUTS_PER_VOICE" : 128,
	"MAX_STATES" : 18,
	"SIDEBAR_MIDI_SCOPE_NOTE_NAMES" : "whether the sidebar midi scopes show labels with note name and octave",
	"SIDEBAR_ALWAYS_SHOW_HELP" : "whether the sidebar shows block help always or just when clicked. the default 0 enables this when a block is added to the patch (ie it decides you're patching rather than playing live), when set to 'never' it won't autoenable like this. when set to 1 it always shows the help. the idea of not showing it is in a live context you don't want too much information.",
	"BOTTOMBAR_HEIGHT" : "this is the height (in row units) of the bottom bar area (where eg mixer controls can be pinned)",
	"UNIVERSAL_COLUMNS" : 6,
	"UNIVERSAL_PATTERNS" : 16,
	"MERGE_PURGE" : "when you merge-load a song in next to the existing setup, if merge purge is enabled any muted blocks (and everything connected to them) are deleted. this is useful when you're playing a live set transitioning between songs.",
	"MAX_PANEL_COLUMNS" : "max number of columns allowed on the panels ui page",
	"SELF_CONNECT_THRESHOLD" : "how far you have to drag a block in a loop before you can connect it to itself",
	"DOUBLE_CLICK_TIME" : "maximum time gap between clicks for it to register as a double click",
	"LONG_PRESS_TIME" : "time delay before a long press is registered",
	"SLIDER_CLICK_SET" : "if this is enabled then when you click on a slider it jumps to the point you clicked on (if off this is selectively enabled on parameters where it makes sense but isn't the default behaviour for most sliders)",
	"SCOPE_DEFAULT_ZOOM" : "zoom setting for the sidebar audio scopes. the default is zoomed in to show waveforms at note frequencies at 0.65. Lower numbers are less zoomed in - eg 0.12 shows about 500ms, or a beat at 120.",
	"AUTOLOAD_INCLUDES_STATES" : "if set to 0 supresses the 'init' state for the autoload patch",
	"MODULATION_IN_PARAMETERS_VIEW" : "if >1 then modulation source names and amount sliders are shown (small) under each row of parameters in the sidebar view. 2 shows the mod connection's offset as well, 3 shows a 2-line version of this.",
	"AUTOZOOM_ON_SELECT" : "if enabled selecting a block causes the equivalent of pressing 'home' - zooming out to show all blocks leaving nothing covering the sidebar",
	"AUTO_INCREMENT_SAVE_KEY" : "tries to save in incrementally numbered files when you press ctrl-s.",
	"CTRL_VOICE_SEL_MOMENTARY" : "if enabled then selecting voices of a block on the parameters view (by holding ctrl and hovering) is momentary - the view reverts to the whole block when you release.",
	"SHOW_STATES_ON_PANELS" : "if enabled then blocks with saved states have them shown on their panel in the panels view",
	"SHOW_KEYBOARD_AUTOMAP_CONNECT_BUTTON" : "shows a shortcut button in the automap area to make an automapped keyboard connection into a permanent one",
	"TREE_SELECT_IGNORES_CONTROL_BLOCKS" : "if enabled then the tree select (eg in the merge purge algorithm, or the select tree key shift-T) misses out control blocks",
	"TARGET_FPS" : "target normal framerate and target framerate when a benny isn't the focused window",
	"SELECTED_BLOCK_Z_MOVE" : "how far forward blocks jump when selected",
	"SELECTED_BLOCK_DEPENDENTS_Z_MOVE" : "the blocks connected to a selected block also jump forward a little, this is how far",
	"METER_TINT" : "meters can be white (1), or the colour of the underlying block (0), or anything inbetween",
	"START_FULLSCREEN" : 0,
	"SHOW_CONTROL_AUTO_DURING_SONG_LOAD" : "if a song has control mapping and this is enabled then as soon as it's available the controller page is shown, so you can see the names of the blocks connected to each knob of your controller.",
	"AUTOMAP_MOUSE_FOLLOW" : "if enabled, when using the controller automap feature, if a block has more rows of parameters than fit on the controller, then hovering the mouse over a row of controls sets the offset so that that row is accessible on the controller.",
	"ENABLE_RECORD_HARDWARE" : "tiny cpu penalty, enables recording directly from hardware blocks.",
	"sidebar_scrollbar_width" : "how many pixels the scrollbar area at the right of the sidebar is",
	"sidebar_width_in_units" : "how wide the sidebar is. adjusting may break various bits of ui? untested.",
	"show_deprecated" : "if on, shows blocks that are flagged as old, removed, in-progress etc, in the menu. for developer use."
}
